/**
 * home mock
 */

const FROM_INFO = [
	{
		src: '',
		name: '鸣人',
		info: '我的忍道，一直都是有话就说，说到做到（嘴遁😀），然后成为大家认可的火影🔥'
	},
	{
		src: '',
		name: '孙悟空',
		info: '哇，好兴奋啊 😠 , 龟 .. 派 .. 气 .. 功 .. 啊......'
	},
	{
		src: '',
		name: '纳兹',
		info: '你准备好成为妖精的尾巴的敌人了吗？🔥 🐲'
	},
	{
		src: '',
		name: '纲吉',
		info: '指环上铭刻着我们的光阴 💍，黑手党什么的，我要亲手毁灭'
	}
];

const REWARDS = [
	{
		src: '',
		reward: 30000000,
		sets: 96,
		info: '打败巴基+克洛船长+克利克提督+恶龙之后海军累加的赏金'
	},
	{
		src: '',
		reward: 100000000,
		sets: 213,
		info: '阿拉巴斯坦事件，打败克洛克达尔'
	},
	{
		src: '',
		reward: 300000000,
		sets: 435,
		info: '司法岛事件，营救罗宾而大闹司法岛，烧毁政府旗帜，打败CP9，正式与世界政府为敌。'
	},
	{
		src: '',
		reward: 400000000,
		sets: 601,
		info: '深海大监狱、顶上战争事件，为营救艾斯，外加此前的天龙人事件。'
	},
	{
		src: '',
		reward: 500000000,
		sets: 801,
		info: '德雷斯罗萨事件，打败唐吉诃德·多弗朗明哥并推翻其统治国家'
	},
	{
		src: '',
		reward: 1500000000,
		sets: 903,
		info: '蛋糕岛事件，营救山治而大闹蛋糕岛，打败夏洛特·克力架和夏洛特·卡塔库栗。'
	}
];

export {
	FROM_INFO,
	REWARDS
};
